source/_posts/2015-01-04-fixing-scrolling-on-asus-c200ma-edu-4gb.html
---
title: "Fixing Scrolling on ASUS C200MA-EDU-4GB"
date: 2015-01-04
layout: post
categories: chromebook
published: true
comments: 
---
<p>
One thing that really bugged me with my new ASUS C22MA Chromebook was
the way that track-pad scrolling worked.  By default it is exactly the
opposite of my MacBook Pro.
</p>

<p>
<!-- more -->
</p>

<p>
Google <a href="https://support.google.com/chromebook/answer/2583287?hl=en">documents the way to change this</a>, but that was not working on
my Chromebook because when I went to the <i>Device</i> section of the
<i>Settings</i> because it indicated that no trackpad was found.
</p>

<p>
As it turns out, the fix is pretty simple.  I just switched from the
<i>stable</i> channel to the <i>beta</i> channel.  After the update completed
all was fine.
</p>

<p>
Switching channels is easy:
</p>

<ul class="org-ul">
<li>Click on the status area in the lower-right corner of the screen.
</li>
<li>Select <i>Settings</i>
</li>
<li>Click the <i>About ChromeOS</i> link in the upper-right corner of the
<i>Settings</i> window.
</li>
<li>Click the <i>More info&#x2026;</i> link just below the button labeled <i>Check
for and apply updates</i>.
</li>
<li>Click on the <i>Change channel&#x2026;</i> button and follow the directions.
</li>
</ul>
